marwanmahmoud/AUTOSAR-TIVAC-Drivers/tm4c123gh6pm_new.h
typedef struct {                                    /*!< UDMA Structure                                                        */
  __IO uint32_t  STAT;                              /*!< DMA Status                                                            */
  __O  uint32_t  CFG;                               /*!< DMA Configuration                                                     */
  __IO uint32_t  CTLBASE;                           /*!< DMA Channel Control Base Pointer                                      */
  __IO uint32_t  ALTBASE;                           /*!< DMA Alternate Channel Control Base Pointer                            */
  __IO uint32_t  WAITSTAT;                          /*!< DMA Channel Wait-on-Request Status                                    */
  __O  uint32_t  SWREQ;                             /*!< DMA Channel Software Request                                          */
  __IO uint32_t  USEBURSTSET;                       /*!< DMA Channel Useburst Set                                              */
  __O  uint32_t  USEBURSTCLR;                       /*!< DMA Channel Useburst Clear                                            */
  __IO uint32_t  REQMASKSET;                        /*!< DMA Channel Request Mask Set                                          */
  __O  uint32_t  REQMASKCLR;                        /*!< DMA Channel Request Mask Clear                                        */
  __IO uint32_t  ENASET;                            /*!< DMA Channel Enable Set                                                */
  __O  uint32_t  ENACLR;                            /*!< DMA Channel Enable Clear                                              */
  __IO uint32_t  ALTSET;                            /*!< DMA Channel Primary Alternate Set                                     */
  __O  uint32_t  ALTCLR;                            /*!< DMA Channel Primary Alternate Clear                                   */
  __IO uint32_t  PRIOSET;                           /*!< DMA Channel Priority Set                                              */
  __O  uint32_t  PRIOCLR;                           /*!< DMA Channel Priority Clear                                            */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  ERRCLR;                            /*!< DMA Bus Error Clear                                                   */
  __I  uint32_t  RESERVED1[300];
  __IO uint32_t  CHASGN;                            /*!< DMA Channel Assignment                                                */
  __IO uint32_t  CHIS;                              /*!< DMA Channel Interrupt Status                                          */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  CHMAP0;                            /*!< DMA Channel Map Select 0                                              */
  __IO uint32_t  CHMAP1;                            /*!< DMA Channel Map Select 1                                              */
  __IO uint32_t  CHMAP2;                            /*!< DMA Channel Map Select 2                                              */
  __IO uint32_t  CHMAP3;                            /*!< DMA Channel Map Select 3                                              */
} UDMA_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define WATCHDOG0_BASE                  0x40000000UL
#define WATCHDOG1_BASE                  0x40001000UL
#define GPIOA_BASE                      0x40004000UL
#define GPIOB_BASE                      0x40005000UL
#define GPIOC_BASE                      0x40006000UL
#define GPIOD_BASE                      0x40007000UL
#define SSI0_BASE                       0x40008000UL
#define SSI1_BASE                       0x40009000UL
#define SSI2_BASE                       0x4000A000UL
#define SSI3_BASE                       0x4000B000UL
#define UART0_BASE                      0x4000C000UL
#define UART1_BASE                      0x4000D000UL
#define UART2_BASE                      0x4000E000UL
#define UART3_BASE                      0x4000F000UL
#define UART4_BASE                      0x40010000UL
#define UART5_BASE                      0x40011000UL
#define UART6_BASE                      0x40012000UL
#define UART7_BASE                      0x40013000UL
#define I2C0_BASE                       0x40020000UL
#define I2C1_BASE                       0x40021000UL
#define I2C2_BASE                       0x40022000UL
#define I2C3_BASE                       0x40023000UL
#define GPIOE_BASE                      0x40024000UL
#define GPIOF_BASE                      0x40025000UL
#define PWM0_BASE                       0x40028000UL
#define PWM1_BASE                       0x40029000UL
#define QEI0_BASE                       0x4002C000UL
#define QEI1_BASE                       0x4002D000UL
#define TIMER0_BASE                     0x40030000UL
#define TIMER1_BASE                     0x40031000UL
#define TIMER2_BASE                     0x40032000UL
#define TIMER3_BASE                     0x40033000UL
#define TIMER4_BASE                     0x40034000UL
#define TIMER5_BASE                     0x40035000UL
#define WTIMER0_BASE                    0x40036000UL
#define WTIMER1_BASE                    0x40037000UL
#define ADC0_BASE                       0x40038000UL
#define ADC1_BASE                       0x40039000UL
#define COMP_BASE                       0x4003C000UL
#define CAN0_BASE                       0x40040000UL
#define CAN1_BASE                       0x40041000UL
#define WTIMER2_BASE                    0x4004C000UL
#define WTIMER3_BASE                    0x4004D000UL
#define WTIMER4_BASE                    0x4004E000UL
#define WTIMER5_BASE                    0x4004F000UL
#define USB0_BASE                       0x40050000UL
#define GPIOA_AHB_BASE                  0x40058000UL
#define GPIOB_AHB_BASE                  0x40059000UL
#define GPIOC_AHB_BASE                  0x4005A000UL
#define GPIOD_AHB_BASE                  0x4005B000UL
#define GPIOE_AHB_BASE                  0x4005C000UL
#define GPIOF_AHB_BASE                  0x4005D000UL
#define EEPROM_BASE                     0x400AF000UL
#define SYSEXC_BASE                     0x400F9000UL
#define HIB_BASE                        0x400FC000UL
#define FLASH_CTRL_BASE                 0x400FD000UL
#define SYSCTL_BASE                     0x400FE000UL
#define UDMA_BASE                       0x400FF000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define WATCHDOG0                       ((WATCHDOG_Type           *) WATCHDOG0_BASE)
#define WATCHDOG1                       ((WATCHDOG_Type           *) WATCHDOG1_BASE)
#define GPIOA                           ((GPIO_Type               *) GPIOA_BASE)
#define GPIOB                           ((GPIO_Type               *) GPIOB_BASE)
#define GPIOC                           ((GPIO_Type               *) GPIOC_BASE)
#define GPIOD                           ((GPIO_Type               *) GPIOD_BASE)
#define SSI0                            ((SSI_Type                *) SSI0_BASE)
#define SSI1                            ((SSI_Type                *) SSI1_BASE)
#define SSI2                            ((SSI_Type                *) SSI2_BASE)
#define SSI3                            ((SSI_Type                *) SSI3_BASE)
#define UART0                           ((UART_Type               *) UART0_BASE)
#define UART1                           ((UART_Type               *) UART1_BASE)
#define UART2                           ((UART_Type               *) UART2_BASE)
#define UART3                           ((UART_Type               *) UART3_BASE)
#define UART4                           ((UART_Type               *) UART4_BASE)
#define UART5                           ((UART_Type               *) UART5_BASE)
#define UART6                           ((UART_Type               *) UART6_BASE)
#define UART7                           ((UART_Type               *) UART7_BASE)
#define I2C0                            ((I2C_Type                *) I2C0_BASE)
#define I2C1                            ((I2C_Type                *) I2C1_BASE)
#define I2C2                            ((I2C_Type                *) I2C2_BASE)
#define I2C3                            ((I2C_Type                *) I2C3_BASE)
#define GPIOE                           ((GPIO_Type               *) GPIOE_BASE)
#define GPIOF                           ((GPIO_Type               *) GPIOF_BASE)
#define PWM0                            ((PWM_Type                *) PWM0_BASE)
#define PWM1                            ((PWM_Type                *) PWM1_BASE)
#define QEI0                            ((QEI_Type                *) QEI0_BASE)
#define QEI1                            ((QEI_Type                *) QEI1_BASE)
#define TIMER0                          ((TIMER_Type              *) TIMER0_BASE)
#define TIMER1                          ((TIMER_Type              *) TIMER1_BASE)
#define TIMER2                          ((TIMER_Type              *) TIMER2_BASE)
#define TIMER3                          ((TIMER_Type              *) TIMER3_BASE)
#define TIMER4                          ((TIMER_Type              *) TIMER4_BASE)
#define TIMER5                          ((TIMER_Type              *) TIMER5_BASE)
#define WTIMER0                         ((WTIMER_Type             *) WTIMER0_BASE)
#define WTIMER1                         ((TIMER_Type              *) WTIMER1_BASE)
#define ADC0                            ((ADC_Type                *) ADC0_BASE)
#define ADC1                            ((ADC_Type                *) ADC1_BASE)
#define COMP                            ((COMP_Type               *) COMP_BASE)
#define CAN0                            ((CAN_Type                *) CAN0_BASE)
#define CAN1                            ((CAN_Type                *) CAN1_BASE)
#define WTIMER2                         ((TIMER_Type              *) WTIMER2_BASE)
#define WTIMER3                         ((TIMER_Type              *) WTIMER3_BASE)
#define WTIMER4                         ((TIMER_Type              *) WTIMER4_BASE)
#define WTIMER5                         ((TIMER_Type              *) WTIMER5_BASE)
#define USB0                            ((USB_Type                *) USB0_BASE)
#define GPIOA_AHB                       ((GPIO_Type               *) GPIOA_AHB_BASE)
#define GPIOB_AHB                       ((GPIO_Type               *) GPIOB_AHB_BASE)
#define GPIOC_AHB                       ((GPIO_Type               *) GPIOC_AHB_BASE)
#define GPIOD_AHB                       ((GPIO_Type               *) GPIOD_AHB_BASE)
#define GPIOE_AHB                       ((GPIO_Type               *) GPIOE_AHB_BASE)
#define GPIOF_AHB                       ((GPIO_Type               *) GPIOF_AHB_BASE)
#define EEPROM                          ((EEPROM_Type             *) EEPROM_BASE)
#define SYSEXC                          ((SYSEXC_Type             *) SYSEXC_BASE)
#define HIB                             ((HIB_Type                *) HIB_BASE)
#define FLASH_CTRL                      ((FLASH_CTRL_Type         *) FLASH_CTRL_BASE)
#define SYSCTL                          ((SYSCTL_Type             *) SYSCTL_BASE)
#define UDMA                            ((UDMA_Type               *) UDMA_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group TM4C123GH6PM */
/** @} */ /* End of group Texas Instruments */

#ifdef __cplusplus
}
#endif


#endif  /* TM4C123GH6PM_H */

